/********************************************************************************************
 *1. Супермаркет---- -
 *Створити ієрархію класів для подання товарів Супермаркету
 *Продукт(назва, термін споживання, категорія - молочні.хлібобулочні та ін., ціна, кількість)
 *Товар(назва, категорія - побутова хімія, текстиль та ін., ціна, кількість)
 *Створити програму для роботи Супермаркету
 *Додавання  продукту(товару) у базу(врахувати, шо товар  у базі може бути наявний або ні)
 *Збереження бази товарів(у файл)
 *Завантаження бази товарів з файлу
 *Перегляд  продуктів(товарів), впорядкованих по категоріях
 *Пошук певного товару(продукту) з видачею інформації про товар(продукт)
 *Видалення певного товару(продукту)  з бази
 ********************************************************************************************
*/
#include<iostream>
#include"SuperMarket.h"

int main() {
	Menu menu;
	menu.SelectFunction();
	
	system("pause");
	return 0;
}